mcu8rookie/Personal_NRF52832_Proj/NRF52_FreeRTOS/UsrCode/Usr_I2C_Sensor.c
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff1, I2C_WtLen1, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen1);
        
        for(i=0;i<I2C_WtLen1;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff1[i]);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn);
        return;
    }
    
    I2C_RdLen1 = 18;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff1, I2C_RdLen1);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C Read %d byte:",I2C_RdLen1);
        
        for(i=0;i<I2C_RdLen1;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff1[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen1;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff1+i,2);
            
            if(chkdat == I2C_RdBuff1[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            //printf("\tchkdat,\t0x%02X,\tOK,",chkdat);
            
            PGS7000_V1D0_Tmpr = I2C_RdBuff1[9];
            PGS7000_V1D0_Tmpr<<=8;
            PGS7000_V1D0_Tmpr += I2C_RdBuff1[10];
            
            PGS7000_V1D0_Humi = I2C_RdBuff1[12];
            PGS7000_V1D0_Humi<<=8;
            PGS7000_V1D0_Humi += I2C_RdBuff1[13];
            
            printf("\tTmpr,%d,\tHumi,%d,",PGS7000_V1D0_Tmpr,PGS7000_V1D0_Humi);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn);
        return;
    }
    
}

void PGS7000V1D0_Read_FW(void)
{
    uint8_t i;
    
    ret_code_t rtn;
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x10;
    I2C_WtBuff[1] = 0x0F;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn);
        return;
    }
    
    I2C_RdLen = 6;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C RD %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            //printf("\tchkdat,\t0x%02X,\tOK,",chkdat);
            
            PGS7000_V1D0_FW = I2C_RdBuff[0];
            PGS7000_V1D0_FW <<= 8;
            PGS7000_V1D0_FW += I2C_RdBuff[1];
            PGS7000_V1D0_FW <<= 8;
            PGS7000_V1D0_FW += I2C_RdBuff[3];
            PGS7000_V1D0_FW <<= 8;
            PGS7000_V1D0_FW += I2C_RdBuff[4];
            
            printf("\tFW,0x%08X,",PGS7000_V1D0_FW);
            printf("\tFW,%d-%d-%d,",I2C_RdBuff[1],I2C_RdBuff[3],I2C_RdBuff[4]);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn);
        return;
    }
    
}



void PGS7000V1DD0_Read_SomeData(void)
{
    
}


// 3.1.2.读取模块SN命令(0x3615, 0xEC05)
uint32_t PGS7000_ProductNum;
uint64_t PGS7000_SN;

void PGS7000V1DD0_Read_SN(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x36;
    I2C_WtBuff[1] = 0x15;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C Read Error:\trtn = %d,",rtn1);
    }
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0xEC;
    I2C_WtBuff[1] = 0x05;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C Read Error:\trtn = %d,",rtn1);
    }
    
    I2C_RdLen = 18;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C Read %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
