mcu8rookie/Personal_NRF52832_Proj/NRF52_FreeRTOS/UsrCode/Usr_I2C_Sensor.c
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            //printf("\tchkdat,\t0x%02X,\tOK,",chkdat);
            
            PGS7000_ProductNum = I2C_RdBuff[0];
            PGS7000_ProductNum <<= 8;
            PGS7000_ProductNum += I2C_RdBuff[1];
            PGS7000_ProductNum <<= 8;
            PGS7000_ProductNum += I2C_RdBuff[3];
            PGS7000_ProductNum <<= 8;
            PGS7000_ProductNum += I2C_RdBuff[4];
            
            printf("\tProductNum,0x%08X,",PGS7000_ProductNum);
            
            PGS7000_SN = I2C_RdBuff[6];
            PGS7000_SN <<= 8;
            PGS7000_SN += I2C_RdBuff[7];
            PGS7000_SN <<= 8;
            PGS7000_SN += I2C_RdBuff[9];
            PGS7000_SN <<= 8;
            PGS7000_SN += I2C_RdBuff[10];
            PGS7000_SN <<= 8;
            PGS7000_SN += I2C_RdBuff[12];
            PGS7000_SN <<= 8;
            PGS7000_SN += I2C_RdBuff[13];
            PGS7000_SN <<= 8;
            PGS7000_SN += I2C_RdBuff[15];
            PGS7000_SN <<= 8;
            PGS7000_SN += I2C_RdBuff[16];
            
            printf("\tSN,0x%016llX,",PGS7000_SN);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C Read Error:\trtn = %d,",rtn2);
    }
    
}

// 3.1.3.设置气体类型(0x3608)

uint16_t PGS7000_GasType = DEF_GASTYPE_R454B;

void PGS7000V1D0_Write_GasType(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    
    I2C_WtLen = 5;
    I2C_WtBuff[0] = 0x36;
    I2C_WtBuff[1] = 0x08;
    I2C_WtBuff[2] = PGS7000_GasType>>8;
    I2C_WtBuff[3] = PGS7000_GasType;
    I2C_WtBuff[4] = PAV7000_CRC8(I2C_WtBuff+2,2);
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
        
        printf("\tProductNum,0x%04X,",PGS7000_GasType);
        
    }
    else
    {
        printf("\nI2C Write Error:\trtn = %d,",rtn1);
    }
    
}

// 3.1.4.复位模块(0x3606)
void PGS7000V1D0_Write_Reset(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x36;
    I2C_WtBuff[1] = 0x06;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
        
    }
    else
    {
        printf("\nI2C Write Error:\trtn = %d,",rtn1);
    }
}

// 3.1.5.开启测量(0x3603)
uint16_t PGS7000_StartMeas = 1;
void PGS7000V1D0_Write_StartMeas(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x36;
    I2C_WtBuff[1] = 0x03;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
        
        PGS7000_StartMeas = 1;
    }
    else
    {
        printf("\nI2C Write Error:\trtn = %d,",rtn1);
    }
}

// 3.1.6.读取数据(0xEC05)
uint16_t PGS7000_PPM;
uint16_t PGS7000_ErrCode;
//uint16_t PGS7000_GasType;
int16_t PGS7000_Tmpr;
int16_t PGS7000_Humi;
int16_t PGS7000_AstValue;

void PGS7000V1D0_Read_Data(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0xEC;
    I2C_WtBuff[1] = 0x05;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C Read Error:\trtn = %d,",rtn1);
    }
    
    I2C_RdLen = 18;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C Read %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            PGS7000_PPM = I2C_RdBuff[0];
            PGS7000_PPM <<= 8;
            PGS7000_PPM += I2C_RdBuff[1];
            
