mcu8rookie/Personal_NRF52832_Proj/NRF52_FreeRTOS/UsrCode/Usr_I2C_Sensor.c
            PGS7000_ErrCode = I2C_RdBuff[3];
            PGS7000_ErrCode <<= 8;
            PGS7000_ErrCode += I2C_RdBuff[4];
            
            PGS7000_GasType = I2C_RdBuff[6];
            PGS7000_GasType <<= 8;
            PGS7000_GasType += I2C_RdBuff[7];
            
            PGS7000_Tmpr = I2C_RdBuff[9];
            PGS7000_Tmpr <<= 8;
            PGS7000_Tmpr += I2C_RdBuff[10];
            
            PGS7000_Humi = I2C_RdBuff[12];
            PGS7000_Humi <<= 8;
            PGS7000_Humi += I2C_RdBuff[13];
            
            printf("\tPPM,%d,\tErrCode,0x%04X,\tGasType,0x%04x,\tTmpr,%d,\tHumi,%d,",PGS7000_PPM,PGS7000_ErrCode,PGS7000_GasType,PGS7000_Tmpr,PGS7000_Humi);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C Read Error:\trtn = %d,",rtn2);
    }
    
}


// 3.2.1.读湿度速率(0x1000)
uint16_t PGS7000_HumiRate;
void PGS7000V1D0_Read_HumiRate(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x10;
    I2C_WtBuff[1] = 0x00;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C Read Error:\trtn = %d,",rtn1);
    }
    
    I2C_RdLen = 3;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C Read %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            PGS7000_HumiRate = I2C_RdBuff[0];
            PGS7000_HumiRate <<= 8;
            PGS7000_HumiRate += I2C_RdBuff[1];
            
            printf("\tHumiRate,%d,",PGS7000_HumiRate);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C Read Error:\trtn = %d,",rtn2);
    }
    
}

// 3.2.2.读raw data(0x1001)
uint16_t PGS7000_TmprRaw;
int16_t PGS7000_SRaw_Original;
int16_t PGS7000_SRaw_Aft_TmprComp;

void PGS7000V1D0_Read_Rawdata(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    
    I2C_WtLen2 = 2;
    I2C_WtBuff2[0] = 0x10;
    I2C_WtBuff2[1] = 0x01;
    
    nrf_gpio_pin_toggle(DEF_LED4);
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff2, I2C_WtLen2, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    nrf_gpio_pin_toggle(DEF_LED4);
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen2);
        
        for(i=0;i<I2C_WtLen2;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff2[i]);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn1);
        return;
    }
    
    I2C_RdLen2 = 9;
    
    nrf_gpio_pin_toggle(DEF_LED4);
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff2, I2C_RdLen2);
    
    nrf_gpio_pin_toggle(DEF_LED4);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C Read %d byte:",I2C_RdLen2);
        
        for(i=0;i<I2C_RdLen2;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff2[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen2;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff2+i,2);
            
            if(chkdat == I2C_RdBuff2[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        nrf_gpio_pin_toggle(DEF_LED4);
        
        if(chkerr == 0)
        {
            PGS7000_TmprRaw = I2C_RdBuff2[0];
            PGS7000_TmprRaw <<= 8;
            PGS7000_TmprRaw += I2C_RdBuff2[1];
            
            PGS7000_SRaw_Original = I2C_RdBuff2[3];
            PGS7000_SRaw_Original <<= 8;
            PGS7000_SRaw_Original += I2C_RdBuff2[4];
            
            PGS7000_SRaw_Aft_TmprComp = I2C_RdBuff2[6];
            PGS7000_SRaw_Aft_TmprComp <<= 8;
            PGS7000_SRaw_Aft_TmprComp += I2C_RdBuff2[7];
            
            printf("\tTmprRaw,%d,\tSRaw_Ofiginal,%d,\tSRaw_Aft_TmprComp,%d,",PGS7000_TmprRaw,PGS7000_SRaw_Original,PGS7000_SRaw_Aft_TmprComp);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn2);
        return;
    }
    
    nrf_gpio_pin_toggle(DEF_LED4);
}

// 3.2.3.读浓度(0x1002)
uint16_t PGS7000_PPM_0;
uint16_t PGS7000_PPM_1;
uint32_t PGS7000_PPM_f;
uint16_t PGS7000_LFL_0;

void PGS7000V1D0_Read_Concentration(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen2 = 2;
    I2C_WtBuff2[0] = 0x10;
    I2C_WtBuff2[1] = 0x02;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff2, I2C_WtLen2, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
