mcu8rookie/Personal_NRF52832_Proj/NRF52_FreeRTOS/UsrCode/Usr_I2C_Sensor.c
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C Write %d byte:",I2C_WtLen2);
        
        for(i=0;i<I2C_WtLen2;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff2[i]);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn1);
        return;
    }
    
    I2C_RdLen2 = 15;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff2, I2C_RdLen2);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C Read %d byte:",I2C_RdLen2);
        
        for(i=0;i<I2C_RdLen2;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff2[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen2;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff2+i,2);
            
            if(chkdat == I2C_RdBuff2[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            PGS7000_PPM_0 = I2C_RdBuff2[0];
            PGS7000_PPM_0 <<= 8;
            PGS7000_PPM_0 += I2C_RdBuff2[1];
            
            PGS7000_PPM_1 = I2C_RdBuff2[3];
            PGS7000_PPM_1 <<= 8;
            PGS7000_PPM_1 += I2C_RdBuff2[4];
            
            PGS7000_PPM_f = I2C_RdBuff2[6];
            PGS7000_PPM_f <<= 8;
            PGS7000_PPM_f += I2C_RdBuff2[7];
            PGS7000_PPM_f <<= 8;
            PGS7000_PPM_f += I2C_RdBuff2[9];
            PGS7000_PPM_f <<= 8;
            PGS7000_PPM_f += I2C_RdBuff2[10];
            
            PGS7000_LFL_0 = I2C_RdBuff2[12];
            PGS7000_LFL_0 <<= 8;
            PGS7000_LFL_0 += I2C_RdBuff2[13];
            
            printf("\tPPM_0,%d,\tPPM_1,%d,\tPPM_f,%d,\tLFL_0,%d,",PGS7000_PPM_0,PGS7000_PPM_1,PGS7000_PPM_f,PGS7000_LFL_0);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn2);
        return;
    }
    
}

uint16_t ASC_Func_En;

uint16_t ASC_Usr_En;
uint16_t ASC_Param_En;
// 3.2.71.读ASC功能开关(0x1140)
void ASC_Read_ASC_Func_En(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0x40;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
    
    I2C_RdLen = 3;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C RD %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            //printf("\tchkdat,\t0x%02X,\tOK,",chkdat);
            
            ASC_Usr_En = I2C_RdBuff[0];
            ASC_Usr_En <<= 8;
            ASC_Usr_En += I2C_RdBuff[1];
            
            printf("\tASC_Usr_En,0x%04X,",ASC_Usr_En);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn2);
    }
    
}

// 3.2.72.写ASC功能开关(0x11C0)
void ASC_Write_ASC_Func_En(uint8_t arg)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    
    ASC_Usr_En = arg;
    
    I2C_WtLen = 5;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0xC0;
    I2C_WtBuff[2] = ASC_Usr_En>>8;
    I2C_WtBuff[3] = ASC_Usr_En;
    I2C_WtBuff[4] = PAV7000_CRC8(I2C_WtBuff+2,2);
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
        
        printf("\tASC_Usr_En,0x%04X,",ASC_Usr_En);
        
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
}


uint16_t ASC_PPM_HighTh;
uint16_t ASC_PPM_LowTh;

// 3.2.73.读ASC判断漂移临界值1(0x1141)
void ASC_Read_ASC_PPM_HighTh(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0x41;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
    
    I2C_RdLen = 3;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C RD %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
