mcu8rookie/Personal_NRF52832_Proj/NRF52_FreeRTOS/UsrCode/Usr_I2C_Sensor.c
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            ASC_Tmpr_RateTh = I2C_RdBuff[0];
            ASC_Tmpr_RateTh <<= 8;
            ASC_Tmpr_RateTh += I2C_RdBuff[1];
            
            printf("\tASC_Tmpr_RateTh,%d,",ASC_Tmpr_RateTh);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn2);
    }
    
}

// 3.2.78.写ASC温度变化速度临界值(0x11C3)
void ASC_Write_ASC_Tmpr_RateTh(uint16_t arg)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    
    ASC_Tmpr_RateTh = arg;
    
    I2C_WtLen = 5;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0xC3;
    I2C_WtBuff[2] = ASC_Tmpr_RateTh>>8;
    I2C_WtBuff[3] = ASC_Tmpr_RateTh;
    I2C_WtBuff[4] = PAV7000_CRC8(I2C_WtBuff+2,2);
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
        
        printf("\tASC_Tmpr_RateTh,%d,",ASC_Tmpr_RateTh);
        
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
}

// 3.2.79.读ASC湿度变化速度临界值(0x1144)
void ASC_Read_ASC_Humi_RateTh(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0x44;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
    
    I2C_RdLen = 3;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C RD %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            ASC_Humi_RateTh = I2C_RdBuff[0];
            ASC_Humi_RateTh <<= 8;
            ASC_Humi_RateTh += I2C_RdBuff[1];
            
            printf("\tASC_Humi_RateTh,%d,",ASC_Humi_RateTh);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn2);
    }
    
}

// 3.2.80.写ASC湿度变化速度临界值(0x11C4)
void ASC_Write_ASC_Humi_RateTh(uint16_t arg)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    
    ASC_Humi_RateTh = arg;
    
    I2C_WtLen = 5;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0xC4;
    I2C_WtBuff[2] = ASC_Humi_RateTh>>8;
    I2C_WtBuff[3] = ASC_Humi_RateTh;
    I2C_WtBuff[4] = PAV7000_CRC8(I2C_WtBuff+2,2);
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
        
        printf("\tASC_Humi_RateTh,%d,",ASC_Humi_RateTh);
        
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
}

int16_t ASC_Tmpr_Rt;
int16_t ASC_Humi_Rt;
int16_t ASC_Tmpr_RateMax30M;
int16_t ASC_Humi_RateMax30M;
int16_t ASC_Tmpr_Rate;
int16_t ASC_Humi_Rate;

// 3.2.81.读ASC温湿度实时数据(0x1145)
void ASC_Read_ASC_TmprHumi_Rt(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0x45;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
    
    I2C_RdLen = 18;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C RD %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
