mcu8rookie/Personal_NRF52832_Proj/NRF52_FreeRTOS/UsrCode/Usr_I2C_Sensor.c
        if(chkerr == 0)
        {
            
            ASC_Tmpr_Rt = I2C_RdBuff[0];
            ASC_Tmpr_Rt <<= 8;
            ASC_Tmpr_Rt += I2C_RdBuff[1];
            
            ASC_Humi_Rt = I2C_RdBuff[3];
            ASC_Humi_Rt <<= 8;
            ASC_Humi_Rt += I2C_RdBuff[4];
            
            ASC_Tmpr_RateMax30M = I2C_RdBuff[6];
            ASC_Tmpr_RateMax30M <<= 8;
            ASC_Tmpr_RateMax30M += I2C_RdBuff[7];
            
            ASC_Humi_RateMax30M = I2C_RdBuff[9];
            ASC_Humi_RateMax30M <<= 8;
            ASC_Humi_RateMax30M += I2C_RdBuff[10];
            
            ASC_Tmpr_Rate = I2C_RdBuff[12];
            ASC_Tmpr_Rate <<= 8;
            ASC_Tmpr_Rate += I2C_RdBuff[13];
            
            ASC_Humi_Rate = I2C_RdBuff[15];
            ASC_Humi_Rate <<= 8;
            ASC_Humi_Rate += I2C_RdBuff[16];
            
            printf("\tASC_Tmpr_Rt,%d,\tASC_Humi_Rt,%d,\tASC_Tmpr_RateMax30M,%d,\tASC_Humi_RateMax30M,%d,\tASC_Tmpr_Rate,%d,\tASC_Humi_Rate,%d,",ASC_Tmpr_Rt,ASC_Humi_Rt,ASC_Tmpr_RateMax30M,ASC_Humi_RateMax30M,ASC_Tmpr_Rate,ASC_Humi_Rate);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn2);
    }
    
}


#define DEF_ASC_ADJUST_VALUE_MAX        (6)
uint16_t ASC_Adjust_Cnt;
int16_t ASC_Adjust_Value[DEF_ASC_ADJUST_VALUE_MAX];

// 3.2.82.读ASC校准值实时数据(0x1146)
void ASC_Read_ASC_Calidata_Rt(void)
{
    uint8_t i;
    
    ret_code_t rtn1 = 0xFF;
    ret_code_t rtn2 = 0xFF;
    
    uint8_t chkdat;
    uint8_t chkerr;
    
    I2C_WtLen = 2;
    I2C_WtBuff[0] = 0x11;
    I2C_WtBuff[1] = 0x46;
    
    rtn1 = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 0);     // have stop condition at the end of write.
    //rtn = Usr_I2C_Write(I2C_PGS7000_V1D0_ADDR_7B, I2C_WtBuff, I2C_WtLen, 1);   // none stop condition at the end of write.
    
    if(rtn1 == NRFX_SUCCESS)
    {
        printf("\nI2C WT %d byte:",I2C_WtLen);
        
        for(i=0;i<I2C_WtLen;i++)
        {
            printf("\t0x%02X,",I2C_WtBuff[i]);
        }
    }
    else
    {
        printf("\nI2C WT Error:\trtn = %d,",rtn1);
    }
    
    
    I2C_RdLen =21;
    
    rtn2 = Usr_I2C_Read(I2C_PGS7000_V1D0_ADDR_7B, I2C_RdBuff, I2C_RdLen);
    
    if(rtn2 == NRFX_SUCCESS)
    {
        
        printf("\nI2C RD %d byte:",I2C_RdLen);
        
        for(i=0;i<I2C_RdLen;i++)
        {
            printf("\t0x%02X,",I2C_RdBuff[i]);
        }
        
        chkerr = 0;
        for(i=0;i<I2C_RdLen;i+=3)
        {
            chkdat = 0;
            
            chkdat = PAV7000_CRC8(I2C_RdBuff+i,2);
            
            if(chkdat == I2C_RdBuff[i+2])
            {
                
            }
            else
            {
                chkerr++;
                printf("\tchk%d,0x%02X\tNG",i+2,chkdat);
            }
        }
        
        if(chkerr == 0)
        {
            
            ASC_Adjust_Cnt = I2C_RdBuff[0];
            ASC_Adjust_Cnt <<= 8;
            ASC_Adjust_Cnt += I2C_RdBuff[1];
            
            ASC_Adjust_Value[0] = I2C_RdBuff[3];
            ASC_Adjust_Value[0] <<= 8;
            ASC_Adjust_Value[0] += I2C_RdBuff[4];
            
            ASC_Adjust_Value[1] = I2C_RdBuff[6];
            ASC_Adjust_Value[1] <<= 8;
            ASC_Adjust_Value[1] += I2C_RdBuff[7];
            
            ASC_Adjust_Value[2] = I2C_RdBuff[9];
            ASC_Adjust_Value[2] <<= 8;
            ASC_Adjust_Value[2] += I2C_RdBuff[10];
            
            ASC_Adjust_Value[3] = I2C_RdBuff[12];
            ASC_Adjust_Value[3] <<= 8;
            ASC_Adjust_Value[3] += I2C_RdBuff[13];
            
            ASC_Adjust_Value[4] = I2C_RdBuff[15];
            ASC_Adjust_Value[4] <<= 8;
            ASC_Adjust_Value[4] += I2C_RdBuff[16];
            
            ASC_Adjust_Value[5] = I2C_RdBuff[18];
            ASC_Adjust_Value[5] <<= 8;
            ASC_Adjust_Value[5] += I2C_RdBuff[19];
            
            printf("\tASC_Adjust_Cnt,%d,\tASC_Adjust_Value[0~5],%d,%d,%d,%d,%d,%d,",ASC_Adjust_Cnt,ASC_Adjust_Value[0],ASC_Adjust_Value[1],ASC_Adjust_Value[2],ASC_Adjust_Value[3],ASC_Adjust_Value[4],ASC_Adjust_Value[5]);
        }
        else
        {
            printf("\tNG_Cnt,\t0x%02X,\t",chkerr);
        }
    }
    else
    {
        printf("\nI2C RD Error:\trtn = %d,",rtn2);
    }
    
}

// 3.2.83.写ASC校准值实时数据(0x11C6)
void ASC_Write_ASC_Calidata_Rt(void)
{

}



#endif





#endif




